#Напишите программу, в которой программа запрашивает
# у пользователя день и месяц,
# а затем выводит сообщение о текущем дне и месяце.

day = input("Какой сейчас день? ")
month = input("Какой сейчас месяц? ")
print("Сейчас день -", day, "Месяца -", month)