# Напишите программу, в которой расстояние, указанное в милях, пере-
# водится в километры. Учесть, что одна миля примерно равна 1,6 километ-
# ра. Расстояние в милях вводится пользователем с клавиатуры.

miles = input("Введите расстояние в милях: ")
print("Растояние в км: ", int(miles) * 1.6)